app/controllers/api/v1/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index
    if params[:title]
      @topic = Topic.select{|topic| topic.title == params[:title]}

INSERT INTO "topics" ("user_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 15], ["title", "gems"], ["created_at", "2018-02-21 01:08:26.283633"], ["updated_at", "2018-02-21 01:08:26.283633"]]
---
  def create

    @topic = Topic.new(topic_params)
    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 31]]
---
  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy