app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:username]
      @user = User.select{|user| user.username == params[:username]}

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "ggore"], ["created_at", "2018-02-21 01:06:55.135613"], ["updated_at", "2018-02-21 01:06:55.135613"]]
---
  def create
    @user = User.create(user_params)